/*


Напишите программу, которая выводит на экран строку "Hello, Legasoft!" (без кавычек)

Sample Input:

Sample Output:

Hello, Legasoft!

*/
class Main {
    public static void main(String[] args) {
        // put your code here
        System.out.println("Hello, Legasoft!");
    }
}